<?php
header("Content-Type: text/html; charset=utf-8");
?>
<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="index.css">
    <title>Сайт Максима Хадеева</title>
</head>
<body>
    <header>
        <div class="head"><b>Сайт Максима Хадеева</b></div>

        <div class="head-navigation">
            <a href="#" class="btn">Главная</a>
            <a href="my-hobbies/my-hobbies.php" class="btn">Мои увлечения</a>
            <a href="../events/events.php" class="btn">События</a>
            <a href="articles-main/articles.php" class="btn">Статьи</a>
        </div> 
    </header>

    <b><h2><div style="display: flex;
    justify-content: center;
    margin: 10%;
    margin-bottom: 0px;
    font-family: 'Permanent Marker', cursive;" class="font-clr">
    Здравствуй друг!
    </div></h2></b>

    <div class="main-message-div">
        <div class="colorless-txt">
            <div class="message-div">Этот сайт является моим личным блогом. Если ты здесь почему-то оказался, а оказаться
                здесь ты случайно не мог, значит я сам дал тебе эту ссылку, в любом случае должно быть, что тебе
                интересно следить за мной и моей жизнью. Как бы странно это только что не прозвучало. Этот сайт по сути
                и является отражением значимых (по моему мнению) моментов моей жизни которые я счел нужным опубликовать здесь.
                <p>Я сделал его в стиле минимализма - только самое нужное, без излишних приукрашиваний. 
                    Сочетание оттенков зелёного, как мне кажется, создаёт спокойную и домашнюю атмосферу. 
                </p>
            </div>
        </div>

        <div class="message-div-compaired">
            <div class="title-div"><b>Почему отдельный сайт а не страница в соц. сетях?
            </b></div>
            <div class="message-div">Во первых, потому что я могу и хочу сделать свой сайт и ничего мне не мешает этим заняться.
                Во вторых, потому что мне хочется иметь свой личный независимый блог, который я сам по своему вкусу
                проектирую и в целом могу себе позволить делать то, что захочу, точно зная, что это могут видеть только те, кому
                я сам скинул ссылку на этот сайт. 
            </div>
        </div>

        <div class="message-div-compaired">
            <div class="title-div"><b>О моём решении создать сайт вкраце</b></div>
            <div class="message-div">
                Итак, кто я такой и почему ты это читаешь? На второй вопрос отвечай сам, а на первый отвечу я: просто челик из 
                интенетов который решил скрафтить свой сайт и сделать его своим личным блогом. У нас ведь еще это не запретили? 
                Ссылку на него я кидаю тем кому почему-то интересно узнать кто я получше и близким, а еще учителю проограммирования (Здравствуйте Егор ;) ). 
                Здесь я поидее буду заливать какие-то события из своей жизни по собственному выбору, чтобы не пришлось отвечать на вопрос "Как прошел день?", 
                и что-нибудь еще, но пока не придумал что. Временно это просто сайт визитка без какого либо актива и новых событий, потому что мне лень париться с 
                MySql да и у меня скоро экзамены (почему я вообще пишу это в то время когда должен к ним готовиться?).
            </div>
        </div>

        <div class="colorless-txt">
            <div class="title-div"><b>О панели навигации</b></div>
            <div class="message-div">
                <ul>
                    <li>Главная - это страница на которой вы сейчас находитесь, она скорее ознакомительная, нечто вроде порога у дверей</li>
                    <br>
                    <li>Мои увлечения - как не трудно понять из названия: эта вкладка расскажет о моих увлечениях котрые были когда-то и о тех которые имеют место быть сейчас</li>
                    <br>
                    <li>События - это пожалуй самая обновляемая вкладка, так как туда я буду выкладывать самые значимые моменты которые мне удастся пережить</li>
                    <br>
                    <li>Статьи - Сюда я буду описывать как случайные интересные мысли пришедние мне в голову так и свои убеждения по разным поводам.</li>
                </ul>
            </div>
        </div>
    </div>



    <footer>
        <div class="footer-content">
            <div class="contacts">Мои контакты: </div>
            <div class="contacts">Номер телефона: +37377907026</div>
            <div class="contacts"><a href="https://vk.com/mrkell1" target="_blank" class="footer-href">Мой вк</a></div>
        </div>
    </footer>
</body>
</html>